# 1. Запустите iPython:
# - Откройте командную строку (терминал).
# - Введите команду ipython или python для запуска iPython.


# 2. Создайте переменные и выполните операции:
# - Создайте переменную num1 и присвойте ей значение 5.
num1 = 5
# - Создайте переменную num2 и присвойте ей значение 3.
num2 = 3
# - Создайте переменную sum и присвойте ей сумму num1 и num2.
sum = num1 + num2

print('Sum:', sum)

# 3. Выполните математические операции:
# - Создайте переменную result и присвойте ей результат выражения num1 * num2 + sum.
result = num1 * num2 + sum
# - Выведите значение переменной result на экран.

print('Result:', result)